In [2]:
import numpy as np
import pandas as pd

In [3]:
ser =pd.Series(["Lagos","Delta","Kaduna"])

In [4]:
ser

0     Lagos
1     Delta
2    Kaduna
dtype: object

In [5]:
ser=pd.Series([1,2,3,4,])

In [6]:
ser

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
# How to create a list and pass it into a pandas series
state=["Lagos","Delta","Kaduna"]
capital=["Ikeja","Asaba","Kaduna"]

In [8]:
ser=pd.Series(data=capital,index=state)

In [9]:
ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [10]:
# using dictionary

In [11]:
stat_dic={"Lagos":"Ikeja",
          "Delta":"Asaba",
          "Kaduna":"Kaduna"}

In [12]:
ser=pd.Series(stat_dic)

In [13]:
ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [14]:
#How to create pandas series using numpy array and also how to create pandas series from a csv.

In [15]:
arr=np.arange(1,10)

In [16]:
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [17]:
# Now you insert the array created using the numpy array into the pandas series

In [18]:
arrSer=pd.Series(arr)

In [19]:
arrSer

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [20]:
# pandas automatically generate the index of this array(arrSec)

In [21]:
arrSer1=np.random.randn(5)

In [22]:
ser=pd.Series(arrSer1)

In [23]:
ser

0    0.345198
1    0.724371
2    0.821948
3   -0.985249
4   -0.397712
dtype: float64

In [24]:
# "'randn' is random normal distribution  us to generate random numbers in the numpy class"

In [25]:
# How to read csv and convert
# When you read a csv file into pandas it get returned as a dataframe

In [26]:
df_value1=pd.read_csv("students.csv")

In [27]:
df_value1

,name,age,sport,Biology_score,Maths_score,English_score
0,Emmanuel Ayomide,27,Football,73.0,58.0,65.0
1,Ibrahim Musa,24,Football,92.0,56.0,80.0
2,Sesan Obi,24,Swimming,67.0,95.0,71.0
3,Kevin Frank,25,Tennis,53.0,85.0,74.0
4,Emeka Jude,24,Basketball,86.0,80.0,93.0
5,Caroline Obi,27,Basketball,92.0,71.0,79.0
6,Franklin Oladele,18,Football,96.0,NaN,70.0
7,Kola Ola,28,Swimming,82.0,95.0,58.0
8,Emmanuel Ovi,23,Tennis,79.0,61.0,68.0
9,Kareem Musa,24,Football,78.0,73.0,86.0
10,Mustapha Ahmed,24,NaN,88.0,84.0,NaN
11,Femi Akin,24,Tennis,90.0,97.0,85.0
12,Tobi Olaniyan,22,Volleyball,51.0,79.0,84.0
13,Kayode Ibrahim,25,Football,58.0,67.0,84.0
14,Nnamdi Ike,26,Swimming,NaN,62.0,88.0
15,Ahmed Musa,24,Football,60.0,90.0,81.0
16,Kevin Frank,25,Tennis,53.0,85.0,74.0
17,Susan James,27,Volleyball,76.0,69.0,54.0
18,Zainab Mohammed,25,Basketball,64.0,95.0,94.0
19,Sesan Obi,26,Swimming,67.0,95.0,71.0

In [28]:
#This is how a data-frame looks like but our goal is to import a series
#And series takes in a column cos it's a one-dimensional label array

In [29]:
pd.read_csv("students.csv",usecols=["name"])

                name
0   Emmanuel Ayomide
1       Ibrahim Musa
2          Sesan Obi
3        Kevin Frank
4         Emeka Jude
5       Caroline Obi
6   Franklin Oladele
7           Kola Ola
8       Emmanuel Ovi
9        Kareem Musa
10    Mustapha Ahmed
11         Femi Akin
12     Tobi Olaniyan
13    Kayode Ibrahim
14        Nnamdi Ike
15        Ahmed Musa
16       Kevin Frank
17       Susan James
18   Zainab Mohammed
19         Sesan Obi

In [30]:
#Now let's create a series out of this data frame using a parameter called squeez

In [67]:
serd=pd.read_csv("students.csv",usecols=["name"],squeeze=True)

In [32]:
# Pandas Attributes and Methods

In [33]:
a_list=[40,2,1,53,34]
stat_dict={'Lagos':'Ikeja',
      'Delta':'Asaba',
      'Kaduna':'Kaduna'}

In [34]:
ser=pd.Series(stat_dict)

In [35]:
ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [36]:
ser.index

Index(['Lagos', 'Delta', 'Kaduna'], dtype='object')

In [37]:
ser.values

array(['Ikeja', 'Asaba', 'Kaduna'], dtype=object)

ser.dtype

In [38]:
ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [39]:
ser1=pd.Series(a_list)

In [40]:
ser1.mean()

26.0

In [41]:
ser.dtype

dtype('O')

In [42]:
# Checking different methods from the pandas series

In [43]:
ser1.sum()

130

In [44]:
ser=pd.Series(stat_dict)

In [45]:
ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [46]:
# Here we a taking a look into python built in function in pandas

In [47]:
list1=list(ser1)

In [48]:
list1

[40, 2, 1, 53, 34]

In [49]:
dict(ser)

{'Lagos': 'Ikeja', 'Delta': 'Asaba', 'Kaduna': 'Kaduna'}

In [50]:
sorted(ser1)

[1, 2, 34, 40, 53]

In [51]:
len(ser1)

5

In [52]:
len(ser)

3

In [53]:
# How to extract values from series
# Extracting by index value
# Extract by Labels
# Use built in functions to extract values off our series

In [54]:
b_list=[20,30,40,50]
state_dict={
    'Lagos':'Ikeja',
    'Delta':"Asaba",
    "Kaduna":"Kaduna"
}

In [55]:
n_ser=pd.Series(state_dict)

In [56]:
n_ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [57]:
ser1=pd.Series(b_list)

In [58]:
ser1

0    20
1    30
2    40
3    50
dtype: int64

In [68]:
serd

0     Emmanuel Ayomide
1         Ibrahim Musa
2            Sesan Obi
3          Kevin Frank
4           Emeka Jude
5         Caroline Obi
6     Franklin Oladele
7             Kola Ola
8         Emmanuel Ovi
9          Kareem Musa
10      Mustapha Ahmed
11           Femi Akin
12       Tobi Olaniyan
13      Kayode Ibrahim
14          Nnamdi Ike
15          Ahmed Musa
16         Kevin Frank
17         Susan James
18     Zainab Mohammed
19           Sesan Obi
Name: name, dtype: object

In [72]:
ser1[2]

40

In [71]:
ser1[0:3]

0    20
1    30
2    40
dtype: int64

In [75]:
# This is slicing out information from a dataset 
ser1[[0,2]

0    20
2    40
dtype: int64

In [77]:
serd[19]

'Sesan Obi'

In [78]:
n_ser

Lagos      Ikeja
Delta      Asaba
Kaduna    Kaduna
dtype: object

In [80]:
n_ser[[0,2]]

Lagos      Ikeja
Kaduna    Kaduna
dtype: object

In [82]:
# Using the label value to index out this series
n_ser['Lagos']

'Ikeja'

In [83]:
# You can also pass in more than one label to find in the values of more than one indice
n_ser[['Lagos','Kaduna']]

Lagos      Ikeja
Kaduna    Kaduna
dtype: object

In [85]:
n_ser.get('Lagos')

'Ikeja'

In [99]:
py=np.random.randn(8)+10

In [102]:
py

array([10.77791723, 11.94536947, 10.09904675,  9.53929546, 11.34479195,
       10.83972225,  9.50982223,  9.0493542 ])

In [100]:
pu=pd.Series(py)

In [105]:
pu.append(n_ser)

0         10.777917
1         11.945369
2         10.099047
3          9.539295
4         11.344792
5         10.839722
6          9.509822
7          9.049354
Lagos         Ikeja
Delta         Asaba
Kaduna       Kaduna
dtype: object

In [106]:
# Arithmetic Operations
# Statistical Computation
c_list=[40,2,1,53,34]

In [107]:
ser_n=pd.Series(c_list)

In [108]:
ser_n

0    40
1     2
2     1
3    53
4    34
dtype: int64

In [109]:
# How to return the minimum value in a list
ser_n.min()

1

In [110]:
ser_n.max()

53

In [111]:
# How to return the index of the maximum number
ser_n.idxmax()

3

In [112]:
ser_n.idxmin()

2

In [114]:
ser_n[ser_n.idxmin()]

1

In [115]:
# Summing all the element in the series
ser_n.sum()

130

In [116]:
ser_n.count()

5

In [117]:
avg=ser_n.sum()/ser_n.count()

In [118]:
avg

26.0

In [119]:
# Another method which I will like to look at is the describe method
ser_n.describe()

count     5.000000
mean     26.000000
std      23.398718
min       1.000000
25%       2.000000
50%      34.000000
75%      40.000000
max      53.000000
dtype: float64